app/controllers/line_items_controller.rb

  def create
    @cart = current_cart
    puts "test ing ---#{@cart.inspect}"
    product = Product.find(params[:product_id])
    # @line_item = @cart.line_items.build(:product => product)
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 ORDER BY name LIMIT 1
INSERT INTO `carts` (`created_at`, `updated_at`) VALUES ('2016-01-06 17:39:01', '2016-01-06 17:39:01')
INSERT INTO `line_items` (`cart_id`, `created_at`, `order_id`, `product_id`, `quantity`, `updated_at`) VALUES (6, '2016-01-06 18:59:01', NULL, 1, 1, '2016-01-06 18:59:01')
UPDATE `line_items` SET `quantity` = 2, `updated_at` = '2016-01-06 18:02:13' WHERE `line_items`.`id` = 1