app/controllers/orders_controller.rb

SELECT COUNT(*) FROM `orders`
SELECT `orders`.* FROM `orders` ORDER BY created_at desc LIMIT 10 OFFSET 0
---
  def index
    @orders = Order.paginate :page=>params[:page], :order=>'created_at desc' ,
:per_page => 10

SELECT COUNT(*) FROM `line_items` WHERE `line_items`.`cart_id` = 6
---
  def new
    @cart = current_cart
    if @cart.line_items.empty?

SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 2 LIMIT 1
---
  def edit
    @order = Order.find(params[:id])

INSERT INTO `carts` (`created_at`, `updated_at`) VALUES ('2016-01-07 18:07:58', '2016-01-07 18:07:58')
INSERT INTO `orders` (`address`, `created_at`, `email`, `name`, `pay_type`, `updated_at`) VALUES ('abc test', '2016-01-07 16:10:30', 'test@gmail.com', 'shruti', 'Check', '2016-01-07 16:10:30')
DELETE FROM `carts` WHERE `carts`.`id` = 6
SELECT `line_items`.* FROM `line_items` WHERE `line_items`.`order_id` = 107
---
  def create
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(current_cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
        session[:cart_id] = nil
        UserMailer.order_received(@order).deliver