app/controllers/products_controller.rb

SELECT `products`.* FROM `products` ORDER BY name
---
  def index
    @products = Product.all

SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 ORDER BY name LIMIT 1
---
  def show
    @product = Product.find(params[:id])

SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 ORDER BY name LIMIT 1
---
  def edit
    @product = Product.find(params[:id])

INSERT INTO `products` (`color`, `created_at`, `description`, `inventory`, `name`, `price`, `sale_price`, `size`, `sku`, `updated_at`) VALUES ('Black,white,grey,navy blue', '2016-01-05 17:37:58', 'Now get this Shivaji themed round neck tshirts in best quality cotton blend.', 8, 'Veer Shivaji Tshirts', 799.0, 625.0, 'S,M,L', 'LGSV001', '2016-01-05 17:37:58')
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save

SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 ORDER BY name LIMIT 1
UPDATE `products` SET `description` = 'This product is for test This product is for test This product is for test This product is for test This product is for test This product is for test This product is for test This product is for test This product is for test This product is for test This product is for test This product is for test This product is for test This product is for test This product is for test This product is for test This product is for test This product is for test This product is for test This product is for test This product is for test This product is for test This product is for test This product is for test ', `updated_at` = '2016-04-18 03:28:50' WHERE `products`.`id` = 1
---
  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])

SELECT `products`.* FROM `products` WHERE `products`.`id` = 3 ORDER BY name LIMIT 1
---
  def who_bought
    @product = Product.find(params[:id])