app/controllers/users_controller.rb

  def index
    @users = User.order(:name)
---
SELECT `users`.* FROM `users` ORDER BY name

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`created_at`, `hashed_password`, `name`, `salt`, `updated_at`) VALUES ('2016-01-08 16:38:39', '8f1fa8cff1cd0e7d352764a73db3790e3c1b464352df5ed6d2cbfb03920376ca', 'shruti', '699393157412800.6239430641632828', '2016-01-08 16:38:39')

  def destroy
    @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 0 LIMIT 1